chore: cleanup, unopinionated formatting
